'''Исполнитель Черепаха действует на плоскости с декартовой системой координат. В начальный момент Черепаха находится
в начале координат, её голова направлена вдоль положительного направления оси ординат, хвост опущен. При опущенном
хвосте Черепаха оставляет на поле след в виде линии. В каждый конкретный момент известно положение исполнителя и
направление его движения. У исполнителя существует две команды: Вперёд n (где n—целое число), вызывающая передвижение
Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m— целое число), вызывающая изменение
направления движения на m градусов по часовой стрелке.
Запись Повтори k [Команда1 Команда2 … КомандаS] означает, что последовательность из S команд повторится k раз.
Черепахе был дан для исполнения следующий алгоритм: Повтори 7 [Вперёд 10 Направо 120].
Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной
данным алгоритмом. Точки на линии учитывать не следует.'''
# from turtle import *
# window = Screen()
# speed(200)
# k = 20
# left(90)
# for i in range(7):
#     forward(10 * k)
#     right(120)
# up()
# for x in range(10):
#     for y in range(11):
#         goto(x*k, y*k)
#         dot(4)
# window.exitonclick()


'''направление его движения. У исполнителя существует две команды: Вперёд n (где n— целое число), вызывающая 
передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m— целое число), 
вызывающая изменение направления движения на m градусов по часовой стрелке. Запись
Повтори k [Команда1 Команда2 … КомандаS]
означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:
Повтори 4 [Вперёд 8 Направо 90 Вперёд 8 Направо 90]
Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной 
данным алгоритмом. Точки на линии учитывать не следует.'''
# from turtle import *
# window = Screen()
# speed(200)
# k = 20
# left(90)
# for i in range(4):
#     forward(8*k)
#     right(90)
#     forward(8*k)
#     right(90)
# up()
# for x in range(9):
#     for y in range(9):
#         goto(x*k, y*k)
#         dot(4)
# window.exitonclick()

'''направление его движения. У исполнителя существует две команды: Вперёд n (где n— целое число), вызывающая 
передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m— целое число), 
вызывающая изменение направления движения на m градусов по часовой стрелке. Запись
Повтори k [Команда1 Команда2 … КомандаS]
означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:
Повтори 5 [Вперёд 8 Направо 60 Вперёд 8 Направо 120]
Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной
данным алгоритмом. Точки на линии учитывать не следует.'''
# from turtle import *
# window = Screen()
# speed(200)
# k = 20
# left(90)
# for i in range(5):
#     forward(8*k)
#     right(60)
#     forward(8 * k)
#     right(120)
# up()
# for x in range(16):
#     for y in range(16):
#         goto(x*k, y*k)
#         dot(4)
# window.exitonclick()


'''направление его движения. У исполнителя существует две команды: Вперёд n (где n— целое число), вызывающая 
передвижение Черепахи на n единиц в том направлении, куда указывает её голова, и Направо m (где m— целое число),
вызывающая изменение направления движения на m градусов по часовой стрелке. Запись
Повтори k [Команда1 Команда2 … КомандаS]
означает, что последовательность из S команд повторится k раз. Черепахе был дан для исполнения следующий алгоритм:
Повтори 12 [Направо 60 Вперёд 1 Направо 60 Вперёд 1 Направо 270]
Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной
 данным алгоритмом. Точки на линии учитывать не следует.'''
# from turtle import *
# window = Screen()
# speed(200)
# k = 20
# left(90)
# for i in range(12):
#     right(60)
#     forward(1*k)
#     right(60)
#     forward(1*k)
#     right(270)
# up()
# for x in range(-5, 5):
#     for y in range(-10, 5):
#         goto(x*k, y*k)
#         dot(2)
# window.exitonclick()

