print("test")
a = 12  # int целые числа
b = 3.1415926  # float дробные числа
c = 'text'  # str строка
d = [2, 4.67, 'cat', [7, 8]]  # list список
d[0] = 9
d[1] = b
d[2] = 'dog'
d[3][1] = 5
print(d)
e = (4, 'apple', 7.8, [8, 9])  # tuple кортеж
f = {5, 'dog', 6.7, 'cat'}  # set множество
s = [2, 4, 4, 2, 5, 4]
print(set(s))
print(f)
g1 = True  # bool логический
g2 = False
h = {'key': 'value', 'Alex': [5, 4, 3, 5]}
print(h['Alex'])

# + - * /
print(5 ** 2)  # степень числа
print(125 ** (1/3))  # кубический корень
print(-25 ** 0.5)
print(pow(-25, 0.5))  # степень числа
print(7 // 3)  # целая часть от деления
print(7 % 3)  # остаток от деления
print(divmod(7, 3))  # (//, %)
print(abs(-7))  # модуль числа

# if условие1:      если
#     блок кода 1
# elif условие2:    иначе если
#     блок кода 2
# else:             иначе при всех остальных условиях
#     блок кода 3

# > больше
# < меньше
# >= больше или равно
# <= меньше или равно
# == равно
# != не равно




